MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L4R9AG/mcu.h
/********************  Bits definition for DCMI_RISR register  ****************/
#define DCMI_RIS_FRAME_RIS_Pos        (0U)
#define DCMI_RIS_FRAME_RIS_Msk        (0x1UL << DCMI_RIS_FRAME_RIS_Pos)        /*!< 0x00000001 */
#define DCMI_RIS_FRAME_RIS            DCMI_RIS_FRAME_RIS_Msk                   /*!< DCMI Capture complete raw interrupt status */
#define DCMI_RIS_OVR_RIS_Pos          (1U)
#define DCMI_RIS_OVR_RIS_Msk          (0x1UL << DCMI_RIS_OVR_RIS_Pos)          /*!< 0x00000002 */
#define DCMI_RIS_OVR_RIS              DCMI_RIS_OVR_RIS_Msk                     /*!< DCMI Overrun raw interrupt status */
#define DCMI_RIS_ERR_RIS_Pos          (2U)
#define DCMI_RIS_ERR_RIS_Msk          (0x1UL << DCMI_RIS_ERR_RIS_Pos)          /*!< 0x00000004 */
#define DCMI_RIS_ERR_RIS              DCMI_RIS_ERR_RIS_Msk                     /*!< DCMI Synchronization error raw interrupt status */
#define DCMI_RIS_VSYNC_RIS_Pos        (3U)
#define DCMI_RIS_VSYNC_RIS_Msk        (0x1UL << DCMI_RIS_VSYNC_RIS_Pos)        /*!< 0x00000008 */
#define DCMI_RIS_VSYNC_RIS            DCMI_RIS_VSYNC_RIS_Msk                   /*!< DCMI VSYNC raw interrupt status */
#define DCMI_RIS_LINE_RIS_Pos         (4U)
#define DCMI_RIS_LINE_RIS_Msk         (0x1UL << DCMI_RIS_LINE_RIS_Pos)         /*!< 0x00000010 */
#define DCMI_RIS_LINE_RIS             DCMI_RIS_LINE_RIS_Msk                    /*!< DCMI Line raw interrupt status */

/********************  Bits definition for DCMI_IER register  *****************/
#define DCMI_IER_FRAME_IE_Pos         (0U)
#define DCMI_IER_FRAME_IE_Msk         (0x1UL << DCMI_IER_FRAME_IE_Pos)         /*!< 0x00000001 */
#define DCMI_IER_FRAME_IE             DCMI_IER_FRAME_IE_Msk                    /*!< DCMI Capture complete interrupt enable */
#define DCMI_IER_OVR_IE_Pos           (1U)
#define DCMI_IER_OVR_IE_Msk           (0x1UL << DCMI_IER_OVR_IE_Pos)           /*!< 0x00000002 */
#define DCMI_IER_OVR_IE               DCMI_IER_OVR_IE_Msk                      /*!< DCMI Overrun interrupt enable */
#define DCMI_IER_ERR_IE_Pos           (2U)
#define DCMI_IER_ERR_IE_Msk           (0x1UL << DCMI_IER_ERR_IE_Pos)           /*!< 0x00000004 */
#define DCMI_IER_ERR_IE               DCMI_IER_ERR_IE_Msk                      /*!< DCMI Synchronization error interrupt enable */
#define DCMI_IER_VSYNC_IE_Pos         (3U)
#define DCMI_IER_VSYNC_IE_Msk         (0x1UL << DCMI_IER_VSYNC_IE_Pos)         /*!< 0x00000008 */
#define DCMI_IER_VSYNC_IE             DCMI_IER_VSYNC_IE_Msk                    /*!< DCMI VSYNC interrupt enable */
#define DCMI_IER_LINE_IE_Pos          (4U)
#define DCMI_IER_LINE_IE_Msk          (0x1UL << DCMI_IER_LINE_IE_Pos)          /*!< 0x00000010 */
#define DCMI_IER_LINE_IE              DCMI_IER_LINE_IE_Msk                     /*!< DCMI Line interrupt enable */
#define DCMI_IER_INT_IE_Pos           (0U)
#define DCMI_IER_INT_IE_Msk           (0x1FUL << DCMI_IER_INT_IE_Pos)          /*!< 0x0000001F */
#define DCMI_IER_INT_IE               DCMI_IER_INT_IE_Msk

/********************  Bits definition for DCMI_MIS register  *****************/
#define DCMI_MIS_FRAME_MIS_Pos        (0U)
#define DCMI_MIS_FRAME_MIS_Msk        (0x1UL << DCMI_MIS_FRAME_MIS_Pos)        /*!< 0x00000001 */
#define DCMI_MIS_FRAME_MIS            DCMI_MIS_FRAME_MIS_Msk                   /*!< DCMI Capture complete masked interrupt status */
#define DCMI_MIS_OVR_MIS_Pos          (1U)
#define DCMI_MIS_OVR_MIS_Msk          (0x1UL << DCMI_MIS_OVR_MIS_Pos)          /*!< 0x00000002 */
#define DCMI_MIS_OVR_MIS              DCMI_MIS_OVR_MIS_Msk                     /*!< DCMI Overrun masked interrupt status */
#define DCMI_MIS_ERR_MIS_Pos          (2U)
#define DCMI_MIS_ERR_MIS_Msk          (0x1UL << DCMI_MIS_ERR_MIS_Pos)          /*!< 0x00000004 */
#define DCMI_MIS_ERR_MIS              DCMI_MIS_ERR_MIS_Msk                     /*!< DCMI Synchronization error masked interrupt status */
#define DCMI_MIS_VSYNC_MIS_Pos        (3U)
#define DCMI_MIS_VSYNC_MIS_Msk        (0x1UL << DCMI_MIS_VSYNC_MIS_Pos)        /*!< 0x00000008 */
#define DCMI_MIS_VSYNC_MIS            DCMI_MIS_VSYNC_MIS_Msk                   /*!< DCMI VSYNC masked interrupt status */
#define DCMI_MIS_LINE_MIS_Pos         (4U)
#define DCMI_MIS_LINE_MIS_Msk         (0x1UL << DCMI_MIS_LINE_MIS_Pos)         /*!< 0x00000010 */
#define DCMI_MIS_LINE_MIS             DCMI_MIS_LINE_MIS_Msk                    /*!< DCMI Line masked interrupt status */

/********************  Bits definition for DCMI_ICR register  *****************/
#define DCMI_ICR_FRAME_ISC_Pos        (0U)
#define DCMI_ICR_FRAME_ISC_Msk        (0x1UL << DCMI_ICR_FRAME_ISC_Pos)        /*!< 0x00000001 */
#define DCMI_ICR_FRAME_ISC            DCMI_ICR_FRAME_ISC_Msk                   /*!< DCMI Capture complete interrupt status clear */
#define DCMI_ICR_OVR_ISC_Pos          (1U)
#define DCMI_ICR_OVR_ISC_Msk          (0x1UL << DCMI_ICR_OVR_ISC_Pos)          /*!< 0x00000002 */
#define DCMI_ICR_OVR_ISC              DCMI_ICR_OVR_ISC_Msk                     /*!< DCMI Overrun interrupt status clear */
#define DCMI_ICR_ERR_ISC_Pos          (2U)
#define DCMI_ICR_ERR_ISC_Msk          (0x1UL << DCMI_ICR_ERR_ISC_Pos)          /*!< 0x00000004 */
#define DCMI_ICR_ERR_ISC              DCMI_ICR_ERR_ISC_Msk                     /*!< DCMI Synchronization error interrupt status clear */
#define DCMI_ICR_VSYNC_ISC_Pos        (3U)
#define DCMI_ICR_VSYNC_ISC_Msk        (0x1UL << DCMI_ICR_VSYNC_ISC_Pos)        /*!< 0x00000008 */
#define DCMI_ICR_VSYNC_ISC            DCMI_ICR_VSYNC_ISC_Msk                   /*!< DCMI Vertical synch interrupt status clear */
#define DCMI_ICR_LINE_ISC_Pos         (4U)
#define DCMI_ICR_LINE_ISC_Msk         (0x1UL << DCMI_ICR_LINE_ISC_Pos)         /*!< 0x00000010 */
#define DCMI_ICR_LINE_ISC             DCMI_ICR_LINE_ISC_Msk                    /*!< DCMI line interrupt status clear */

/********************  Bits definition for DCMI_ESCR register  ****************/
#define DCMI_ESCR_FSC_Pos             (0U)
#define DCMI_ESCR_FSC_Msk             (0xFFUL << DCMI_ESCR_FSC_Pos)            /*!< 0x000000FF */
#define DCMI_ESCR_FSC                 DCMI_ESCR_FSC_Msk                        /*!< DCMI Frame start delimiter code FSC[7:0] */
#define DCMI_ESCR_FSC_0               (0x01UL << DCMI_ESCR_FSC_Pos)            /*!< 0x00000001 */
#define DCMI_ESCR_FSC_1               (0x02UL << DCMI_ESCR_FSC_Pos)            /*!< 0x00000002 */
#define DCMI_ESCR_FSC_2               (0x04UL << DCMI_ESCR_FSC_Pos)            /*!< 0x00000004 */
#define DCMI_ESCR_FSC_3               (0x08UL << DCMI_ESCR_FSC_Pos)            /*!< 0x00000008 */
#define DCMI_ESCR_FSC_4               (0x10UL << DCMI_ESCR_FSC_Pos)            /*!< 0x00000010 */
#define DCMI_ESCR_FSC_5               (0x20UL << DCMI_ESCR_FSC_Pos)            /*!< 0x00000020 */
#define DCMI_ESCR_FSC_6               (0x40UL << DCMI_ESCR_FSC_Pos)            /*!< 0x00000040 */
#define DCMI_ESCR_FSC_7               (0x80UL << DCMI_ESCR_FSC_Pos)            /*!< 0x00000080 */
#define DCMI_ESCR_LSC_Pos             (8U)
#define DCMI_ESCR_LSC_Msk             (0xFFUL << DCMI_ESCR_LSC_Pos)            /*!< 0x0000FF00 */
#define DCMI_ESCR_LSC                 DCMI_ESCR_LSC_Msk                        /*!< DCMI Line start delimiter code LSC[7:0] */
#define DCMI_ESCR_LSC_0               (0x01UL << DCMI_ESCR_LSC_Pos)            /*!< 0x00000100 */
#define DCMI_ESCR_LSC_1               (0x02UL << DCMI_ESCR_LSC_Pos)            /*!< 0x00000200 */
#define DCMI_ESCR_LSC_2               (0x04UL << DCMI_ESCR_LSC_Pos)            /*!< 0x00000400 */
#define DCMI_ESCR_LSC_3               (0x08UL << DCMI_ESCR_LSC_Pos)            /*!< 0x00000800 */
#define DCMI_ESCR_LSC_4               (0x10UL << DCMI_ESCR_LSC_Pos)            /*!< 0x00001000 */
#define DCMI_ESCR_LSC_5               (0x20UL << DCMI_ESCR_LSC_Pos)            /*!< 0x00002000 */
#define DCMI_ESCR_LSC_6               (0x40UL << DCMI_ESCR_LSC_Pos)            /*!< 0x00004000 */
#define DCMI_ESCR_LSC_7               (0x80UL << DCMI_ESCR_LSC_Pos)            /*!< 0x00008000 */
#define DCMI_ESCR_LEC_Pos             (16U)
#define DCMI_ESCR_LEC_Msk             (0xFFUL << DCMI_ESCR_LEC_Pos)            /*!< 0x00FF0000 */
#define DCMI_ESCR_LEC                 DCMI_ESCR_LEC_Msk                        /*!< DCMI Line end delimiter code LEC[7:0] */
#define DCMI_ESCR_LEC_0               (0x01UL << DCMI_ESCR_LEC_Pos)            /*!< 0x00010000 */
#define DCMI_ESCR_LEC_1               (0x02UL << DCMI_ESCR_LEC_Pos)            /*!< 0x00020000 */
#define DCMI_ESCR_LEC_2               (0x04UL << DCMI_ESCR_LEC_Pos)            /*!< 0x00040000 */
#define DCMI_ESCR_LEC_3               (0x08UL << DCMI_ESCR_LEC_Pos)            /*!< 0x00080000 */
#define DCMI_ESCR_LEC_4               (0x10UL << DCMI_ESCR_LEC_Pos)            /*!< 0x00100000 */
#define DCMI_ESCR_LEC_5               (0x20UL << DCMI_ESCR_LEC_Pos)            /*!< 0x00200000 */
#define DCMI_ESCR_LEC_6               (0x40UL << DCMI_ESCR_LEC_Pos)            /*!< 0x00400000 */
#define DCMI_ESCR_LEC_7               (0x80UL << DCMI_ESCR_LEC_Pos)            /*!< 0x00800000 */
#define DCMI_ESCR_FEC_Pos             (24U)
#define DCMI_ESCR_FEC_Msk             (0xFFUL << DCMI_ESCR_FEC_Pos)            /*!< 0xFF000000 */
#define DCMI_ESCR_FEC                 DCMI_ESCR_FEC_Msk                        /*!< DCMI Frame end delimiter code FEC[7:0] */
#define DCMI_ESCR_FEC_0               (0x01UL << DCMI_ESCR_FEC_Pos)            /*!< 0x01000000 */
#define DCMI_ESCR_FEC_1               (0x02UL << DCMI_ESCR_FEC_Pos)            /*!< 0x02000000 */
#define DCMI_ESCR_FEC_2               (0x04UL << DCMI_ESCR_FEC_Pos)            /*!< 0x04000000 */
#define DCMI_ESCR_FEC_3               (0x08UL << DCMI_ESCR_FEC_Pos)            /*!< 0x08000000 */
#define DCMI_ESCR_FEC_4               (0x10UL << DCMI_ESCR_FEC_Pos)            /*!< 0x10000000 */
#define DCMI_ESCR_FEC_5               (0x20UL << DCMI_ESCR_FEC_Pos)            /*!< 0x20000000 */
#define DCMI_ESCR_FEC_6               (0x40UL << DCMI_ESCR_FEC_Pos)            /*!< 0x40000000 */
#define DCMI_ESCR_FEC_7               (0x80UL << DCMI_ESCR_FEC_Pos)            /*!< 0x80000000 */

/********************  Bits definition for DCMI_ESUR register  ****************/
#define DCMI_ESUR_FSU_Pos             (0U)
#define DCMI_ESUR_FSU_Msk             (0xFFUL << DCMI_ESUR_FSU_Pos)            /*!< 0x000000FF */
#define DCMI_ESUR_FSU                 DCMI_ESUR_FSU_Msk                        /*!< DCMI Frame start delimiter unmask FSU[7:0] */
#define DCMI_ESUR_FSU_0               (0x01UL << DCMI_ESUR_FSU_Pos)            /*!< 0x00000001 */
#define DCMI_ESUR_FSU_1               (0x02UL << DCMI_ESUR_FSU_Pos)            /*!< 0x00000002 */
#define DCMI_ESUR_FSU_2               (0x04UL << DCMI_ESUR_FSU_Pos)            /*!< 0x00000004 */
#define DCMI_ESUR_FSU_3               (0x08UL << DCMI_ESUR_FSU_Pos)            /*!< 0x00000008 */
#define DCMI_ESUR_FSU_4               (0x10UL << DCMI_ESUR_FSU_Pos)            /*!< 0x00000010 */
#define DCMI_ESUR_FSU_5               (0x20UL << DCMI_ESUR_FSU_Pos)            /*!< 0x00000020 */
#define DCMI_ESUR_FSU_6               (0x40UL << DCMI_ESUR_FSU_Pos)            /*!< 0x00000040 */
#define DCMI_ESUR_FSU_7               (0x80UL << DCMI_ESUR_FSU_Pos)            /*!< 0x00000080 */
#define DCMI_ESUR_LSU_Pos             (8U)
#define DCMI_ESUR_LSU_Msk             (0xFFUL << DCMI_ESUR_LSU_Pos)            /*!< 0x0000FF00 */
#define DCMI_ESUR_LSU                 DCMI_ESUR_LSU_Msk                        /*!< DCMI Line start delimiter unmask LSU[7:0] */
#define DCMI_ESUR_LSU_0               (0x01UL << DCMI_ESUR_LSU_Pos)            /*!< 0x00000100 */
#define DCMI_ESUR_LSU_1               (0x02UL << DCMI_ESUR_LSU_Pos)            /*!< 0x00000200 */
#define DCMI_ESUR_LSU_2               (0x04UL << DCMI_ESUR_LSU_Pos)            /*!< 0x00000400 */
#define DCMI_ESUR_LSU_3               (0x08UL << DCMI_ESUR_LSU_Pos)            /*!< 0x00000800 */
#define DCMI_ESUR_LSU_4               (0x10UL << DCMI_ESUR_LSU_Pos)            /*!< 0x00001000 */
#define DCMI_ESUR_LSU_5               (0x20UL << DCMI_ESUR_LSU_Pos)            /*!< 0x00002000 */
#define DCMI_ESUR_LSU_6               (0x40UL << DCMI_ESUR_LSU_Pos)            /*!< 0x00004000 */
#define DCMI_ESUR_LSU_7               (0x80UL << DCMI_ESUR_LSU_Pos)            /*!< 0x00008000 */
#define DCMI_ESUR_LEU_Pos             (16U)
#define DCMI_ESUR_LEU_Msk             (0xFFUL << DCMI_ESUR_LEU_Pos)            /*!< 0x00FF0000 */
#define DCMI_ESUR_LEU                 DCMI_ESUR_LEU_Msk                        /*!< DCMI Line end delimiter unmask LEU[7:0] */
#define DCMI_ESUR_LEU_0               (0x01UL << DCMI_ESUR_LEU_Pos)            /*!< 0x00010000 */
#define DCMI_ESUR_LEU_1               (0x02UL << DCMI_ESUR_LEU_Pos)            /*!< 0x00020000 */
#define DCMI_ESUR_LEU_2               (0x04UL << DCMI_ESUR_LEU_Pos)            /*!< 0x00040000 */
#define DCMI_ESUR_LEU_3               (0x08UL << DCMI_ESUR_LEU_Pos)            /*!< 0x00080000 */
#define DCMI_ESUR_LEU_4               (0x10UL << DCMI_ESUR_LEU_Pos)            /*!< 0x00100000 */
#define DCMI_ESUR_LEU_5               (0x20UL << DCMI_ESUR_LEU_Pos)            /*!< 0x00200000 */
#define DCMI_ESUR_LEU_6               (0x40UL << DCMI_ESUR_LEU_Pos)            /*!< 0x00400000 */
#define DCMI_ESUR_LEU_7               (0x80UL << DCMI_ESUR_LEU_Pos)            /*!< 0x00800000 */
#define DCMI_ESUR_FEU_Pos             (24U)
#define DCMI_ESUR_FEU_Msk             (0xFFUL << DCMI_ESUR_FEU_Pos)            /*!< 0xFF000000 */
#define DCMI_ESUR_FEU                 DCMI_ESUR_FEU_Msk                        /*!< DCMI Frame end delimiter unmask FEU[7:0] */
#define DCMI_ESUR_FEU_0               (0x01UL << DCMI_ESUR_FEU_Pos)            /*!< 0x01000000 */
#define DCMI_ESUR_FEU_1               (0x02UL << DCMI_ESUR_FEU_Pos)            /*!< 0x02000000 */
#define DCMI_ESUR_FEU_2               (0x04UL << DCMI_ESUR_FEU_Pos)            /*!< 0x04000000 */
#define DCMI_ESUR_FEU_3               (0x08UL << DCMI_ESUR_FEU_Pos)            /*!< 0x08000000 */
#define DCMI_ESUR_FEU_4               (0x10UL << DCMI_ESUR_FEU_Pos)            /*!< 0x10000000 */
#define DCMI_ESUR_FEU_5               (0x20UL << DCMI_ESUR_FEU_Pos)            /*!< 0x20000000 */
#define DCMI_ESUR_FEU_6               (0x40UL << DCMI_ESUR_FEU_Pos)            /*!< 0x40000000 */
#define DCMI_ESUR_FEU_7               (0x80UL << DCMI_ESUR_FEU_Pos)            /*!< 0x80000000 */

/********************  Bits definition for DCMI_CWSTRT register  **************/
#define DCMI_CWSTRT_HOFFCNT_Pos       (0U)
#define DCMI_CWSTRT_HOFFCNT_Msk       (0x3FFFUL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00003FFF */
#define DCMI_CWSTRT_HOFFCNT           DCMI_CWSTRT_HOFFCNT_Msk                  /*!< DCMI Horizontal offset count HOFFCNT[13:0] */
#define DCMI_CWSTRT_HOFFCNT_0         (0x0001UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000001 */
#define DCMI_CWSTRT_HOFFCNT_1         (0x0002UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000002 */
#define DCMI_CWSTRT_HOFFCNT_2         (0x0004UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000004 */
#define DCMI_CWSTRT_HOFFCNT_3         (0x0008UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000008 */
#define DCMI_CWSTRT_HOFFCNT_4         (0x0010UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000010 */
#define DCMI_CWSTRT_HOFFCNT_5         (0x0020UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000020 */
#define DCMI_CWSTRT_HOFFCNT_6         (0x0040UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000040 */
#define DCMI_CWSTRT_HOFFCNT_7         (0x0080UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000080 */
#define DCMI_CWSTRT_HOFFCNT_8         (0x0100UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000100 */
#define DCMI_CWSTRT_HOFFCNT_9         (0x0200UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000200 */
#define DCMI_CWSTRT_HOFFCNT_10        (0x0400UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000400 */
#define DCMI_CWSTRT_HOFFCNT_11        (0x0800UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00000800 */
#define DCMI_CWSTRT_HOFFCNT_12        (0x1000UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00001000 */
#define DCMI_CWSTRT_HOFFCNT_13        (0x2000UL << DCMI_CWSTRT_HOFFCNT_Pos)    /*!< 0x00002000 */
#define DCMI_CWSTRT_VST_Pos           (16U)
#define DCMI_CWSTRT_VST_Msk           (0x1FFFUL << DCMI_CWSTRT_VST_Pos)        /*!< 0x1FFF0000 */
#define DCMI_CWSTRT_VST               DCMI_CWSTRT_VST_Msk                      /*!< DCMI Vertical start line count VST[12:0] */
#define DCMI_CWSTRT_VST_0             (0x0001UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x00010000 */
#define DCMI_CWSTRT_VST_1             (0x0002UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x00020000 */
#define DCMI_CWSTRT_VST_2             (0x0004UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x00040000 */
#define DCMI_CWSTRT_VST_3             (0x0008UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x00080000 */
#define DCMI_CWSTRT_VST_4             (0x0010UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x00100000 */
#define DCMI_CWSTRT_VST_5             (0x0020UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x00200000 */
#define DCMI_CWSTRT_VST_6             (0x0040UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x00400000 */
#define DCMI_CWSTRT_VST_7             (0x0080UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x00800000 */
#define DCMI_CWSTRT_VST_8             (0x0100UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x01000000 */
#define DCMI_CWSTRT_VST_9             (0x0200UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x02000000 */
#define DCMI_CWSTRT_VST_10            (0x0400UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x04000000 */
#define DCMI_CWSTRT_VST_11            (0x0800UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x08000000 */
#define DCMI_CWSTRT_VST_12            (0x1000UL << DCMI_CWSTRT_VST_Pos)        /*!< 0x10000000 */

